szevczenko/hq_led_lamp/sdkconfig.defaults
# Target: ESP32-WROOM-32D
CONFIG_IDF_TARGET="esp32"

# Flash size — adjust once the exact module SKU is confirmed
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# Use custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Main task stack (on-target finding, TASK-128): the boot supervisor on the
# main task loads and applies the broker/TLS configuration
# (mqtt_cfg_load_and_apply) BEFORE the Wi-Fi/provisioning stages, so the
# main task also runs the mbedTLS/heap-heavy configuration path.  The
# ESP-IDF default (3584 B) overflows "task main" during that apply on a
# fresh configured device, so the standard flash/monitor loop would fail
# the no-backtrace assertion at the very first configured boot.  The
# dominant consumer is mqtt_cfg_apply(): it captures the applied CA / mTLS
# material as three mqtt_cfg_cert_snapshot_t stack locals (~5 KiB each,
# MQTT_CERT_MAX_SIZE 5120 + header), i.e. ~15.4 KiB in one frame before
# the caller stack is counted — a 16 KiB stack still overflows.  32768 B
# keeps the full filesystem -> configuration -> Wi-Fi -> provisioning ->
# TLS gate on the main task with comfortable headroom for the verified-TLS
# handshake.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# Wi-Fi HTTP provisioning (TASK-126): the product-owned provisioning adapter
# (components/wifi_provisioning_manager) builds the platform provisioning
# portal (HTTP portal + captive DNS on the shared Mongoose process) into the
# image.  The platform's automatic fallback controller
# (wifi_provisioning_controller.c, hq_platform TASK-011..016) is COMPILED IN
# (TASK-131): CONFIG_WIFI_HTTP_PROVISIONING_AUTO_FALLBACK=y with a bounded
# CONNECT_FAILED budget (CONFIG_WIFI_HTTP_PROVISIONING_FALLBACK_ATTEMPTS=2)
# so a transient connect failure does not open the provisioning AP but
# exhausted credentials do.  The controller is NOT yet wired into app_main
# (wiring is TASK-132/133): while half-wired it is inert, and the product
# still owns the "start provisioning when no saved credential exists"
# decision through the adapter's has-saved-credentials query.
CONFIG_WIFI_HTTP_PROVISIONING=y
CONFIG_WIFI_HTTP_PROVISIONING_AUTO_FALLBACK=y
CONFIG_WIFI_HTTP_PROVISIONING_FALLBACK_ATTEMPTS=2
# Success-grace interval (TASK-131): the single source of truth is the
# platform knob CONFIG_WIFI_HTTP_PROVISIONING_SUCCESS_GRACE_MS — the product
# duplicate CONFIG_KLC_PROVISIONING_GRACE_MS was dropped (documented decision
# in the TASK-131 notes) so the product's grace retire and the platform
# controller's grace retire both drive the same portal value.  2000 ms keeps
# the product's historical default.
CONFIG_WIFI_HTTP_PROVISIONING_SUCCESS_GRACE_MS=2000
